[
  {
    "title": "Indonesia FM Blasts Citi, Defends MSCI Downgrade",
    "publisher": "Bloomberg",
    "link": "https://finance.yahoo.com/video/indonesia-fm-blasts-citi-defends-150829805.html",
    "published_at": "2026-02-03 15:08:29",
    "type": "VIDEO",
    "thumbnail": "https://s.yimg.com/uu/api/res/1.2/iEkoAm0_RszOwslYz0pkxw--~B/aD03MjA7dz0xMjgwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_video_2/d82e359825dae0a6ebca7b281eed6cf1",
    "related_tickers": [],
    "summary": "Indonesian Finance Minister Purbaya Yudhi Sadewa defended the country's economic track in the wake of a recent slump in the rupiah and local stocks. In a conversation with Bloomberg's Haslinda Amin at a business forum in Jakarta, the minister criticized Citigroup Inc. for a report that said the nation's budget deficit could breach the legal limit this year. Purbaya also iterated that the revocation of mining permits was a step toward fostering a positive investment climate in Southeast Asia's largest economy, stating \"we are against illegal mining.\""
  },
  {
    "title": "Indonesia’s Central Bank Holds as Rupiah, Policy Worries Mount",
    "publisher": "The Wall Street Journal",
    "link": "",
    "published_at": "2026-01-21 10:36:00",
    "type": "STORY",
    "thumbnail": "https://s.yimg.com/uu/api/res/1.2/lmYdbFUrccexB11dhVVDjw--~B/aD02NDA7dz0xMjgwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/wsj.com/562b28062baaaf1dc86d8545ab72b028",
    "related_tickers": [],
    "summary": "Indonesia’s central bank kept interest rates unchanged again in its first policy meeting of the year, a decision that comes as the rupiah slides to new lows and concerns mount over the country’s fiscal outlook."
  },
  {
    "title": "Barclays on Rupiah's Record Low",
    "publisher": "Bloomberg",
    "link": "https://finance.yahoo.com/video/barclays-rupiahs-record-low-043507055.html",
    "published_at": "2026-01-20 04:35:07",
    "type": "VIDEO",
    "thumbnail": "https://s.yimg.com/uu/api/res/1.2/4LaUYmLB4.mHaeBMB5ortg--~B/aD03MjA7dz0xMjgwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_video_2/a0848228f451dc39da97ffc84a0f5b53",
    "related_tickers": [],
    "summary": "The Indonesian rupiah has hit a record low against the U.S. dollar over concerns around central bank independence and policy direction. Mitul Kotecha, Head of Asia FX at Barclays, shares why he expects some stabilization ahead for the currency."
  },
  {
    "title": "Indonesia’s Central Bank Holds Rates as Rupiah Stability in Focus",
    "publisher": "The Wall Street Journal",
    "link": "",
    "published_at": "2025-12-17 09:59:00",
    "type": "STORY",
    "thumbnail": "https://s.yimg.com/uu/api/res/1.2/f5CiCj4SO9wExYo5NcLWpw--~B/aD02NDA7dz0xMjgwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/wsj.com/53b05deaa52fdf6313910e8836f57cc7",
    "related_tickers": [],
    "summary": "The decision was aimed at maintaining rupiah’s stability amid persistent global uncertainty, strengthening monetary-policy transmission and supporting economic growth, Gov. Perry Warjiyo said."
  },
  {
    "title": "Bank Indonesia Holds Rate Again to Maintain Rupiah Stability",
    "publisher": "The Wall Street Journal",
    "link": "",
    "published_at": "2025-11-19 09:13:00",
    "type": "STORY",
    "thumbnail": "https://s.yimg.com/uu/api/res/1.2/lmYdbFUrccexB11dhVVDjw--~B/aD02NDA7dz0xMjgwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/wsj.com/562b28062baaaf1dc86d8545ab72b028",
    "related_tickers": [],
    "summary": "The Indonesian central bank’s governor said the short-term focus is on stabilizing the rupiah and attracting foreign investment amid rising global uncertainty."
  },
  {
    "title": "Rupee ends little changed, importer hedging caps lift from softer dollar",
    "publisher": "Reuters",
    "link": "https://finance.yahoo.com/news/fed-cut-certainty-tariff-worries-025546481.html",
    "published_at": "2025-09-15 02:55:46",
    "type": "STORY",
    "thumbnail": "https://s.yimg.com/uu/api/res/1.2/4HxznH0zQCbsdYXu8RM0Qg--~B/aD01NDM7dz04MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/reuters.com/d36603df3ecfa851272a1ef2db199914",
    "related_tickers": [],
    "summary": "The Indian rupee closed nearly flat on Monday, as the boost from a broadly weaker dollar was blunted by persistent hedging demand from importers and lacklustre foreign portfolio flows.  While the currency rose to an intraday peak of 88.1475, traders pointed out that dollar demand from local importers, including oil companies, shaved its gains later in the session.  Data released on Monday showed that India's merchandise trade deficit narrowed in August to $26.49 billion, from $27.35 billion in July, as exports slowed after U.S. President Donald Trump hiked import tariffs on Indian goods."
  },
  {
    "title": "ING Comments on Indonesia's Rupee",
    "publisher": "MT Newswires",
    "link": "https://finance.yahoo.com/news/ing-comments-indonesia-apos-rupee-162813722.html",
    "published_at": "2025-09-09 16:28:13",
    "type": "STORY",
    "thumbnail": "",
    "related_tickers": [],
    "summary": "ING said it very rarely writes about the Indonesian rupiah in this space, but recent developments ar"
  },
  {
    "title": "Tariff worries stall rupee rally after US jobs data boost",
    "publisher": "Reuters",
    "link": "https://finance.yahoo.com/news/tariff-worries-stall-rupee-rally-102507099.html",
    "published_at": "2025-09-09 10:25:07",
    "type": "STORY",
    "thumbnail": "https://s.yimg.com/uu/api/res/1.2/Adl5bEgZSh6RAhmXZoDtLA--~B/aD01MzM7dz04MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/reuters.com/afef3a45bcb313ba385057a819284ab8",
    "related_tickers": [],
    "summary": "The rupee advanced on Tuesday, supported by weaker U.S. jobs data that firmed up expectations of a Federal Reserve rate cut, before losing traction around the 88 per dollar level.  The rupee has been among the worst performing Asian currencies this year, pressured by the punitive U.S. tariffs on Indian goods that have dented sentiment and fuelled sustained dollar demand.  The rupee rose 0.18% to 88.1025 against 88.2650 on Friday, when it fell to a record low of 88.36."
  },
  {
    "title": "Yuan short bets hit May highs as China's economic woes weigh on emerging market currencies",
    "publisher": "Reuters",
    "link": "https://finance.yahoo.com/news/yuan-short-bets-hit-may-072704411.html",
    "published_at": "2025-08-21 07:27:04",
    "type": "STORY",
    "thumbnail": "https://s.yimg.com/uu/api/res/1.2/pOc_tYmj5s8klRSXU5xsfg--~B/aD01MzM7dz04MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/reuters.com/d0ca63e405fb16752b68267f5321161b",
    "related_tickers": [],
    "summary": "Bearish bets on China's yuan hit their highest since mid-May, with analysts turning short for the first time amid mounting concerns over the economy, a Reuters poll showed on Thursday. China's economy lost steam in July, with retail sales rising just 3.7% year-on-year, well below the 5.9% growth expected in a Reuters poll. Industrial output grew 5.7%, its weakest pace since November 2024."
  },
  {
    "title": "Rupee weakens slightly, broad dollar softness cushions pressure",
    "publisher": "Reuters",
    "link": "https://finance.yahoo.com/news/rupee-likely-remain-backfoot-asia-030045139.html",
    "published_at": "2025-07-21 03:00:45",
    "type": "STORY",
    "thumbnail": "https://s.yimg.com/uu/api/res/1.2/4TArmoyg6rjb_WzpTtjBKw--~B/aD01MzM7dz04MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/reuters.com/a3e72c05b883f98f7724d0ff791f1b22",
    "related_tickers": [],
    "summary": "The Indian rupee logged a modest decline on Monday, pressured by dollar bids from foreign and local private banks, though broad-based weakness in the greenback helped the local currency limit further losses.  Asian currencies were flat-to-slightly higher, while the dollar index declined by nearly 0.2% to 98.2.  The Indian rupee and the Indonesian rupiah are among the few regional currencies nursing losses on the year so far, even as their peers, such as the Taiwan dollar and the Korean won, have climbed over 11% and 6%, respectively."
  }
]